using System;


class Sheets
{
    static void Main()
    {
        
        //int A10 = 1;    //0
        //int A9 = 2;     //1
        //int A8 = 4;     //2
        //int A7 = 8;     //3
        //int A6 = 16;    //4
        //int A5 = 32;    //5
        //int A4 = 64;    //6
        //int A3 = 128;   //7
        //int A2 = 256;   //8
        //int A1 = 512;   //9
        //int A0 = 1024;  //10
        /*
         * Всеки един лист съдържа в себе си определен брой листа с формат А10, като бройката винаги е число,
         * което е степен на 2. Тяхното бинарно представяне е следното

            А10 - 1 бр. - 1

            А9 - 2 бр - 10

            А8 - 4 бр - 100

            А7 - 8 бр.- 1000

            А6 - 16 бр.- 10000

            и т.н.

            В този случай, цикълът върти по всички листа, които притежава Ася, и на всяка 
         * итерация, маската представлява броя лист А10 съдържащи се в обработвания лист.

        От това следва, че когато &(and) маската с търсения брой листове (N) ще получим число различно от нула само в
         * случайте, когато в N има едно срещу единицата в маската. (което ще рече че този лист се 
         * използва за достигане до правилната бройка N). В случая по условие се иска да печатаме тези,
         * които НЕ се използват, затова печатаме когато N & mask == 0.

        Нека вземем числото 7 и видим какво се получава. Бинарното му представяне е 111.

        На първата итерация на цикъла, маската е със стойност 1. =>  111 & 1 = 001 (число различно от нула) 
         * съответно не го печатаме.

        На втората итерация маската е 10. => 111 & 10 = 010 ( пак число различно от нула.

        Същото е и за 3-тото. На четвъртата итерация, вече маската ни ще е 1000 и когато я енднем с 111 ще получим нула.
         * Съответно печатаме A10-i = A7.

        и т.н. Надявам се си ме разбрал, ако не поискай още разяснение ( не ме бива много да обяснявам задачи с битове).
        Reshenie s pobitovi***************************************************************************/
        //int n = int.Parse(Console.ReadLine());
        
        //for (int i = 0; i < 11; i++)
        //{
        //    int mask = 1;
        //    mask <<= i;

        //    if ((n & mask) == 0)
        //    {
        //        Console.WriteLine("A{0}", 10 - i);
        //    }
        //}
        //Reshenie s masivi&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
        int sum = int.Parse(Console.ReadLine());
        int[] MyArray = { 1024 , 512 , 256 , 128 , 64 , 32 , 16 , 8 , 4 , 2 , 1};
        for (int i = 0; i < MyArray.Length; i++)
        {
            if (sum - MyArray[i] >= 0 && sum !=0)
            {
                sum = sum - MyArray[i];
            }
            else
            {
                Console.WriteLine("A" + i);
            }
        }

    }
}

